"""
以前設定した目標：先輩として相応しい人物に
    ⇒具体化が難しい。具体化するための前提能力が足りない？

再設定：自発的な目標を具体的に立てられるように。（GCにおける）
    ⇒GCにおいて必要な能力（仕事内容を理解できるだけの）が必要
    　（つまり、具体的な目標となり得るものを認識するだけの能力）
    これを
    １．一般的な能力（エンジニア・社会人として）
    ２．専門的な能力（GCスタッフとして）
    に分けてみる

        １．一般的な能力（不可分なものだが感覚的に分けている）
            プログラミング・開発・CP科学的なもの
                ・言語について
                ・開発手法について
                ・アルゴリズム
                ・仮想環境
                ・データベース
                ・ネットワーク
                ・セキュリティ
                ・システム構成
                ・OS
                など…
            
            ビジネス的なもの
                ・財務
                ・人
                ・トレンド
                ・（デザイン）
                ・（行動経済）
                など…
        
        ２．専門的な能力（自社サービスに関わる知識）
    
    ITパスポートを掘り下げるような形で前回よりは妥当感あり。
    分けた、列挙したところでゴール（妥協点）がいまいち分からないが…

・
・絶対的にできること・足りないことのリストを明示
・直近のスケジュール、TODOの紹介
・直近のスケジュール感、目標感を重視


・前回の目標は抽象的・観測不可能
・目標は目標設定
・そのためには良い意味での愚直な学び・断続的な目標設定へのトライ
・これまでと直近の目標、そのスケジュール・方法を提示
    『ITパスポート』『独学プログラマー』『JavaScriptの教科書』『マスタリングTCP/IP』
    Anki
    



"""